<template>
  <footer class="max-w-screen-xl px-8 mx-auto">

    <div class="w-full border-y border-[#DDDDDD]">

      <div class="grid">
        <div
          class="md:w-full lg:w-full w-full sm:w-1/2 xl:w-fit flex flex-col sm:flex-row sm:px-6 py-6 sm:py-12 sm:space-x-10 sm:border-r-0 border-[#DDDDDD]"
        >
          <div class="sm:hidden xl:block mb-6 sm:mb-0">
            <a href="#">
              <!-- <img :src="require('~/assets/img/logo/nefa.svg')" class="w-24 -mt-2" alt="Nefa Logo" /> -->
              <div class="flex flex-row items-center" style="font-family: Do Hyeon;  font-size: 2rem;">
                <img :src="require('~/assets/img/fishingyou_main/logo.png')" class="w-10 xl:w-10" alt="FishingYou Logo" />
                <div class="ml-4" style="color:dodgerblue">FISHING<span style="color:deepskyblue">YOU</span></div>
              </div>
            </a>
          </div>
          <ul class="space-y-4 ml-2">
            <NavLink name="저작권" detail="fishingyou는 유튜브 라이선스, 컨텐츠 저작권을 철저히 준수하고 있습니다." url="#" />
            <NavLink name="적용기술" detail="유튜브 이용약관 4조 A항에 따라 embeded player는 유튜브에서 권장하는 iframe 기술을 적용하였습니다." url="#" />
            <NavLink name="큐레이션 대상 콘텐츠" detail="1. CC BY 라이센스가 적용된 컨텐츠 2. 해당 채널과 콘텐츠 제공 협약이 체결된 유튜브 표준 라이센스 콘텐츠" url="#" />
            <NavLink name="콘텐츠 관리" detail="CC BY 라이선스 원칙에 따라 저작자명, 출처를 표시하고 있으며 원 소유자의 요청시 즉각 수정 및 삭제" url="#" />
          </ul>

          <div class="card w-96 flex flex-col justify-between">
            <div class="card-title">&copy; 펜트하우스
            <div class="flex flex-row items-center mt-2">
              <button class="btn btn-sm" >
                <a href="https://www.facebook.com/skyloungepenthouse">
                <div class=" w-24px h-24px"><svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 24 24"><path fill="currentColor" d="M12 2.04c-5.5 0-10 4.49-10 10.02c0 5 3.66 9.15 8.44 9.9v-7H7.9v-2.9h2.54V9.85c0-2.51 1.49-3.89 3.78-3.89c1.09 0 2.23.19 2.23.19v2.47h-1.26c-1.24 0-1.63.77-1.63 1.56v1.88h2.78l-.45 2.9h-2.33v7a10 10 0 0 0 8.44-9.9c0-5.53-4.5-10.02-10-10.02Z"/></svg></div></a>
              </button>
              <button class="btn btn-sm ml-3">
              <a  href="https://www.instagram.com/skyloungepenthouse/?hl=ko">
                <div class=" w-24px h-24px"><svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 24 24"><path fill="currentColor" d="M7.8 2h8.4C19.4 2 22 4.6 22 7.8v8.4a5.8 5.8 0 0 1-5.8 5.8H7.8C4.6 22 2 19.4 2 16.2V7.8A5.8 5.8 0 0 1 7.8 2m-.2 2A3.6 3.6 0 0 0 4 7.6v8.8C4 18.39 5.61 20 7.6 20h8.8a3.6 3.6 0 0 0 3.6-3.6V7.6C20 5.61 18.39 4 16.4 4H7.6m9.65 1.5a1.25 1.25 0 0 1 1.25 1.25A1.25 1.25 0 0 1 17.25 8A1.25 1.25 0 0 1 16 6.75a1.25 1.25 0 0 1 1.25-1.25M12 7a5 5 0 0 1 5 5a5 5 0 0 1-5 5a5 5 0 0 1-5-5a5 5 0 0 1 5-5m0 2a3 3 0 0 0-3 3a3 3 0 0 0 3 3a3 3 0 0 0 3-3a3 3 0 0 0-3-3Z"/></svg></div></a>
              </button>
              <button class="btn btn-sm  ml-3">
              <a href="https://www.youtube.com/channel/UCZwxAnPHWpPn9GwKfoVweNw?view_as=subscriber">
                <div class=" w-24px h-24px"><svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 24 24"><path fill="currentColor" d="m10 15l5.19-3L10 9v6m11.56-7.83c.13.47.22 1.1.28 1.9c.07.8.1 1.49.1 2.09L22 12c0 2.19-.16 3.8-.44 4.83c-.25.9-.83 1.48-1.73 1.73c-.47.13-1.33.22-2.65.28c-1.3.07-2.49.1-3.59.1L12 19c-4.19 0-6.8-.16-7.83-.44c-.9-.25-1.48-.83-1.73-1.73c-.13-.47-.22-1.1-.28-1.9c-.07-.8-.1-1.49-.1-2.09L2 12c0-2.19.16-3.8.44-4.83c.25-.9.83-1.48 1.73-1.73c.47-.13 1.33-.22 2.65-.28c1.3-.07 2.49-.1 3.59-.1L12 5c4.19 0 6.8.16 7.83.44c.9.25 1.48.83 1.73 1.73Z"/></svg></div></a>
              </button>
            </div>
            </div>
            <div class="card-body mt-4">
              <p>대표 : 심재용 | 사업자등록번호 : 604-09-94147</p>
              <p>통신판매업 신고번호 : 제2020-인천부평-2397호</p>
              <p>소재지 : 인천시 부평구 시장로30번길 5 901호</p>
              <p>Mobile : 010-3182-6983</p>
              <p>email : siz0001@naver.com</p>
            </div>
            <div class="card-action flex flex-row mt-4">
              <button class="btn btn-outline px-1" onclick="modal1.showModal()">
                개인정보 처리방침
              </button>
            <dialog id="modal1" class="modal">
              <form method="dialog">
              <div class="flex justify-end">
                <button class="w-12px h-12px">
                  <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32"><path fill="currentColor" d="M24 9.4L22.6 8L16 14.6L9.4 8L8 9.4l6.6 6.6L8 22.6L9.4 24l6.6-6.6l6.6 6.6l1.4-1.4l-6.6-6.6L24 9.4z"/></svg>
                </button>
              </div>
              <div>
                <h3 class="mb-4px mt-24px text-lg font-bold">
                  개인정보처리방침
                </h3>
                <p class="py-4">
                  '펜트하우스'은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을
                  보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록
                  다음과 같은 처리방침을 두고 있습니다.
                  <br />
                  '펜트하우스' 은(는) 회사는 개인정보처리방침을 개정하는 경우 웹사이트
                  공지사항(또는 개별공지)을 통하여 공지할 것입니다. <br />
                  ○ 본 방침은부터 2020년 12월 31일부터 시행됩니다. <br /><br />
                  1. 개인정보의 처리 목적 '펜트하우스'은(는) 개인정보를 다음의 목적을 위해
                  처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며
                  이용 목적이 변경될 시에는 사전동의를 구할 예정입니다. <br />가. 홈페이지
                  회원가입 및 관리 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인
                  식별·인증, 회원자격 유지·관리, 제한적 본인확인제 시행에 따른 본인확인,
                  서비스 부정이용 방지, 만14세 미만 아동 개인정보 수집 시 법정대리인 동의
                  여부 확인, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을
                  목적으로 개인정보를 처리합니다. <br />나. 민원사무 처리 민원인의 신원
                  확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등을
                  목적으로 개인정보를 처리합니다. <br />다. 재화 또는 서비스 제공 물품배송,
                  서비스 제공, 청구서 발송, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증,
                  연령인증, 요금결제·정산 등을 목적으로 개인정보를 처리합니다. <br />라.
                  마케팅 및 광고에의 활용 신규 서비스(제품) 개발 및 맞춤 서비스 제공,
                  서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계
                  등을 목적으로 개인정보를 처리합니다.<br />
                  <br />2. 개인정보 파일 현황 <br />1. 개인정보 파일명 :
                  펜트하우스.users.txt <br />개인정보 항목 : 이메일, 휴대전화번호, 비밀번호,
                  로그인ID, 성별, 생년월일, 이름 <br />수집방법 : 홈페이지, 제휴사로부터
                  제공 받음, 생성정보 수집 툴을 통한 수집 <br />보유근거 : 홈페이지 서비스
                  이용<br />
                  보유기간 : 5년 <br />관련법령 : 대금결제 및 재화 등의 공급에 관한 기록 :
                  5년, 계약 또는 청약철회 등에 관한 기록 : 5년 <br /><br />3. 개인정보의
                  처리 및 보유 기간<br />
                  ① ('펜트하우스')은(는) 법령에 따른 개인정보 보유·이용기간 또는
                  정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간 내에서
                  개인정보를 처리,보유합니다. <br />② 각각의 개인정보 처리 및 보유 기간은
                  다음과 같습니다. 1 와 관련한 개인정보는 수집.이용에 관한 동의일로부터까지
                  위 이용목적을 위하여 보유.이용됩니다.<br />
                  보유근거 : 서비스 이용 <br />관련법령 : <br />1)대금결제 및 재화 등의
                  공급에 관한 기록 : 5년 <br />2) 계약 또는 청약철회 등에 관한 기록 : 5년
                  <br />예외사유 : <br />4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법
                  이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다. <br />①
                  정보주체는 펜트하우스에 대해 언제든지 개인정보 열람,정정,삭제,처리정지
                  요구 등의 권리를 행사할 수 있습니다.<br />
                  ② 제1항에 따른 권리 행사는펜트하우스에 대해 개인정보 보호법 시행령
                  제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수
                  있으며 펜트하우스은(는) 이에 대해 지체 없이 조치하겠습니다.<br />
                  ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등
                  대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지
                  제11호 서식에 따른 위임장을 제출하셔야 합니다.<br />
                  ④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조
                  제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.<br />
                  ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로
                  명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다. <br />⑥
                  펜트하우스은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구,
                  처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를
                  확인합니다.<br /><br />
                  5. 처리하는 개인정보의 항목 작성<br />
                  ① '펜트하우스'은(는) 다음의 개인정보 항목을 처리하고 있습니다. <br />1
                  필수항목 : 이메일, 휴대전화번호, 비밀번호 질문과 답, 비밀번호, 로그인ID,
                  성별, 생년월일, 이름 -<br />
                  선택항목 : <br /><br />6. 개인정보의 파기('펜트하우스')은(는) 원칙적으로
                  개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다.
                  파기의 절차, 기한 및 방법은 다음과 같습니다. <br />-파기절차 이용자가
                  입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류)
                  내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시
                  파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는
                  다른 목적으로 이용되지 않습니다. <br />-파기기한 이용자의 개인정보는
                  개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에,
                  개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그
                  개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로
                  인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다. <br />-파기방법
                  전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.
                  종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다
                  <br /><br />7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항
                  <br />① 펜트하우스 은 개별적인 맞춤서비스를 제공하기 위해 이용정보를
                  저장하고 수시로 불러오는 ‘쿠기(cookie)’를 사용합니다. <br />② 쿠키는
                  웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게
                  보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도
                  합니다. <br />가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹
                  사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을
                  파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. <br />나. 쿠키의
                  설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의
                  옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다. <br />다. 쿠키 저장을
                  거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.
                  <br /><br />8. 개인정보 보호책임자 작성 <br />① 펜트하우스 은(는) 개인정보
                  처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의
                  불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를
                  지정하고 있습니다. <br />▶ 개인정보 보호책임자 성명 :심재용 직책 :대표
                  직급 :대표 연락처 :010-3182-6983, siz0001@naver.com, ※ 개인정보 보호
                  담당부서로 연결됩니다. <br />▶ 개인정보 보호 담당부서 부서명 : 담당자 :
                  연락처 :, ,<br />
                  ② 정보주체께서는 펜트하우스 의 서비스(또는 사업)을 이용하시면서 발생한
                  모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보
                  보호책임자 및 담당부서로 문의하실 수 있습니다. 펜트하우스 은(는)
                  정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.
                  <br /><br />9. 개인정보 처리방침 변경 <br />①이 개인정보처리방침은
                  시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이
                  있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할
                  것입니다. <br /><br />10. 개인정보의 안전성 확보 조치 ('펜트하우스')은(는)
                  개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한
                  기술적/관리적 및 물리적 조치를 하고 있습니다. <br />1. 정기적인 자체 감사
                  실시 개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체
                  감사를 실시하고 있습니다. <br />2. 개인정보 취급 직원의 최소화 및 교육
                  개인정보를 취급하는 직원을 지정하고 담당자에 한정시켜 최소화 하여
                  개인정보를 관리하는 대책을 시행하고 있습니다. <br />3. 내부관리계획의 수립
                  및 시행 개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고
                  있습니다. <br />4. 해킹 등에 대비한 기술적 대책 펜트하우스('펜트하우스')은
                  해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여
                  보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된
                  구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.
                  <br />5. 개인정보의 암호화 이용자의 개인정보는 비밀번호는 암호화 되어 저장
                  및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송
                  데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을
                  사용하고 있습니다. <br />6. 접속기록의 보관 및 위변조 방지
                  개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며,
                  접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.
                  <br />7. 개인정보에 대한 접근 제한 개인정보를 처리하는
                  데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에
                  대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여
                  외부로부터의 무단 접근을 통제하고 있습니다. <br />8. 문서보안을 위한
                  잠금장치 사용 개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는
                  안전한 장소에 보관하고 있습니다. <br />9. 비인가자에 대한 출입 통제
                  개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제
                  절차를 수립, 운영하고 있습니다.
                </p>
                </div>
                </form>
              </dialog>
              <button class="btn btn-outline px-1" onclick="modal2.showModal()">
                이용 약관
              </button>
              <dialog id="modal2" class="modal2">
              <form method="dialog">
              <div class="flex justify-end">
                <button class="w-12px h-12px">
                  <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32"><path fill="currentColor" d="M24 9.4L22.6 8L16 14.6L9.4 8L8 9.4l6.6 6.6L8 22.6L9.4 24l6.6-6.6l6.6 6.6l1.4-1.4l-6.6-6.6L24 9.4z"/></svg>
                </button>
              </div>
              <div>
                <h3 class="mb-4px mt-24px text-lg font-bold">
                  펜트하우스 디지털콘텐츠 이용 약관[시행 '22.12.31.]
                </h3>
                <p class="py-4">
                  제1장 총칙 제1조(목적) 이 약관은 펜트하우스가 온라인으로 제공하는
      디지털콘텐츠(이하 "콘텐츠"라고 한다) 및 제반서비스의 이용과 관련하여
      펜트하우스와 이용자와의 권리, 의무 및 책임사항 등을 규정함을 목적으로
      합니다.
      <br />
      제2조(정의) 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
      <br />1."펜트하우스"라 함은 "콘텐츠" 산업과 관련된 경제활동을 영위하는
      자로서 콘텐츠 및 제반서비스를 제공하는 자를 말합니다. <br />2. "이용자"라
      함은 "펜트하우스"의 사이트에 접속하여 이 약관에 따라 "펜트하우스"가
      제공하는 "콘텐츠" 및 제반서비스를 이용하는 회원 및 비회원을 말합니다.

      <br />3. "회원"이라 함은 "펜트하우스"와 이용계약을 체결하고 "이용자"
      아이디(ID)를 부여받은 "이용자"로서 "펜트하우스"의 정보를 지속적으로
      제공받으며 "펜트하우스"가 제공하는 서비스를 지속적으로 이용할 수 있는 자를
      말합니다. <br />4. "비회원"이라 함은 "회원"이 아니면서 "펜트하우스"가
      제공하는 서비스를 이용하는 자를 말합니다. <br />5. "콘텐츠"라 함은
      정보통신망이용촉진 및 정보보호 등에 관한 법률 제2조 제1항 제1호의 규정에
      의한 정보통신망에서 사용되는 부호·문자·음성·음향·이미지 또는 영상 등으로
      표현된 자료 또는 정보로서, 그 보존 및 이용에 있어서 효용을 높일 수 있도록
      전자적 형태로 제작 또는 처리된 것을 말합니다. <br />6. "아이디(ID)"라 함은
      "회원"의 식별과 서비스이용을 위하여 "회원"이 정하고 "펜트하우스"가
      승인하는 문자 또는 숫자의 조합을 말합니다. <br />7. "비밀번호(PASSWORD)"라
      함은 "회원"이 부여받은 "아이디"와 일치되는 "회원"임을 확인하고 비밀보호를
      위해 "회원" 자신이 정한 문자 또는 숫자의 조합을 말합니다.
      <br />제3조(신원정보 등의 제공) "펜트하우스"는 이 약관의 내용, 상호,
      대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를
      포함), 전화번호, 모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업
      신고번호 및 개인정보관리책임자 등을 이용자가 쉽게 알 수 있도록 온라인
      서비스초기화면에 게시합니다. 다만, 약관은 이용자가 연결화면을 통하여 볼 수
      있도록 할 수 있습니다. <br />제4조(약관의 게시 등) <br />① "펜트하우스"는
      이 약관을 "회원"이 그 전부를 인쇄할 수 있고 거래과정에서 해당 약관의
      내용을 확인할 수 있도록 기술적 조치를 취합니다. <br />② "펜트하우스"는
      "이용자"가 "펜트하우스"와 이 약관의 내용에 관하여 질의 및 응답할 수 있도록
      기술적 장치를 설치합니다. <br />③ "펜트하우스"는 "이용자"가 약관에
      동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회, 환불조건 등과 같은
      중요한 내용을 이용자가 쉽게 이해할 수 있도록 별도의 연결화면 또는 팝업화면
      등을 제공하여 "이용자"의 확인을 구합니다. <br />제5조(약관의 개정 등)
      <br />① "펜트하우스"는 온라인 디지털콘텐츠산업 발전법, 전자상거래 등에서의
      소비자보호에 관한 법률, 약관의 규제에 관한 법률 등 관련법을 위배하지 않는
      범위에서 이 약관을 개정할 수 있습니다. <br />② "펜트하우스"가 약관을
      개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께
      서비스초기화면에 그 적용일자 7일 이전부터 적용일 후 상당한 기간동안
      공지하고, 기존회원에게는 개정약관을 전자우편주소로 발송합니다. <br />③
      "펜트하우스"가 약관을 개정할 경우에는 개정약관 공지 후 개정약관의 적용에
      대한 "이용자"의 동의 여부를 확인합니다. "이용자"가 개정약관의 적용에
      동의하지 않는 경우 "펜트하우스" 또는 "이용자"는 콘텐츠 이용계약을 해지할
      수 있습니다. 이때, "펜트하우스"는 계약해지로 인하여 "이용자"가 입은 손해를
      배상합니다. <br />제6조(약관의 해석) 이 약관에서 정하지 아니한 사항과 이
      약관의 해석에 관하여는 온라인 디지털콘텐츠산업 발전법, 전자상거래 등에서의
      소비자보호에 관한 법률, 약관의 규제에 관한 법률, 문화체육관광부장관이
      정하는 디지털콘텐츠이용자보호지침, 기타 관계법령 또는 상관례에 따릅니다.
      <br />제2장 회원가입 제7조(회원가입) <br />① 회원가입은 "이용자"가 약관의
      내용에 대하여 동의를 하고 회원가입신청을 한 후 "펜트하우스"가 이러한
      신청에 대하여 승낙함으로써 체결됩니다. <br />② 회원가입신청서에는 다음
      사항을 기재해야 합니다. 1호 내지 3호의 사항은 필수사항이며, 그 외의 사항은
      선택사항입니다. <br />1. "회원"의 성명과 주민등록번호 또는 인터넷상
      개인식별번호 <br />2. "아이디"와 "비밀번호" <br />3. 전자우편주소 <br />4.
      이용하려는 "콘텐츠"의 종류 <br />5. 기타 "펜트하우스"가 필요하다고
      인정하는 사항 <br />③ "펜트하우스"는 상기 "이용자"의 신청에 대하여
      회원가입을 승낙함을 원칙으로 합니다. 다만, "펜트하우스"는 다음 각 호에
      해당하는 신청에 대하여는 승낙을 하지 않을 수 있습니다. <br />1.
      가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우
      <br />2. 실명이 아니거나 타인의 명의를 이용한 경우 <br />3. 허위의 정보를
      기재하거나, 펜트하우스가 제시하는 내용을 기재하지 않은 경우 <br />4.
      이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을
      위반하며 신청하는 경우 <br />④ "펜트하우스"는 서비스 관련 설비의 여유가
      없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
      <br />⑤ 제3항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한
      경우, "펜트하우스"는 이를 신청자에게 알려야 합니다. "펜트하우스"의
      귀책사유 없이 신청자에게 통지할 수 없는 경우에는 예외로 합니다. <br />⑥
      회원가입계약의 성립 시기는 "펜트하우스"의 승낙이 "이용자"에게 도달한
      시점으로 합니다. <br />제8조(미성년자의 회원가입에 관한 특칙) <br />① 만
      14세 미만의 "이용자"는 개인정보의 수집 및 이용목적에 대하여 충분히
      숙지하고 부모 등 법정대리인의 동의를 얻은 후에 회원가입을 신청하고 본인의
      개인정보를 제공하여야 합니다. <br />② 펜트하우스는 부모 등 법정대리인의
      동의에 대한 확인절차를 거치지 않은 14세 미만 이용자에 대하여는 가입을 취소
      또는 불허합니다. <br />③ 만 14세 미만 "이용자"의 부모 등 법정대리인은
      아동에 대한 개인정보의 열람, 정정, 갱신을 요청하거나 회원가입에 대한
      동의를 철회할 수 있으며, 이러한 경우에 "펜트하우스"는 지체 없이 필요한
      조치를 취해야 합니다. <br />제9조(회원정보의 변경) <br />① "회원"은
      개인정보관리화면을 통하여 언제든지 자신의 개인정보를 열람하고 수정할 수
      있습니다. <br />② "회원"은 회원가입신청 시 기재한 사항이 변경되었을 경우
      온라인으로 수정을 하거나 전자우편 기타 방법으로 "펜트하우스"에 대하여 그
      변경사항을 알려야 합니다. <br />③ 제2항의 변경사항을 "펜트하우스"에 알리지
      않아 발생한 불이익에 대하여 "펜트하우스"는 책임지지 않습니다.
      <br />제10조("회원"의 "아이디" 및 "비밀번호"의 관리에 대한 의무) <br />①
      "회원"의 "아이디"와 "비밀번호"에 관한 관리책임은 "회원"에게 있으며, 이를
      제3자가 이용하도록 하여서는 안 됩니다. <br />② "회원"은 "아이디" 및
      "비밀번호"가 도용되거나 제3자에 의해 사용되고 있음을 인지한 경우에는 이를
      즉시 "펜트하우스"에 통지하고 "펜트하우스"의 안내에 따라야 합니다. <br />③
      제2항의 경우에 해당 "회원"이 "펜트하우스"에 그 사실을 통지하지 않거나,
      통지한 경우에도 "펜트하우스"의 안내에 따르지 않아 발생한 불이익에 대하여
      "펜트하우스"는 책임지지 않습니다. <br />제11조("회원"에 대한 통지) ①
      "펜트하우스"가 "회원"에 대한 통지를 하는 경우 "회원"이 지정한
      전자우편주소로 할 수 있습니다. <br />② "펜트하우스"는 "회원" 전체에 대한
      통지의 경우 7일 이상 "펜트하우스"의 게시판에 게시함으로써 제1항의 통지에
      갈음할 수 있습니다. 다만, "회원" 본인의 거래와 관련하여 중대한 영향을
      미치는 사항에 대하여는 제1항의 통지를 합니다. <br />제12조(회원탈퇴 및
      자격 상실 등) <br />① "회원"은 "펜트하우스"에 언제든지 탈퇴를 요청할 수
      있으며 "펜트하우스"는 즉시 회원탈퇴를 처리합니다. <br />② "회원"이 다음
      각호의 사유에 해당하는 경우, "펜트하우스"는 회원자격을 제한 및 정지시킬 수
      있습니다. <br />1. 가입신청 시에 허위내용을 등록한 경우 <br />2.
      "펜트하우스"의 서비스이용대금, 기타 "펜트하우스"의 서비스이용에 관련하여
      회원이 부담하는 채무를 기일에 이행하지 않는 경우 <br />3. 다른 사람의
      "펜트하우스"의 서비스이용을 방해하거나 그 정보를 도용하는 등 전자상거래
      질서를 위협하는 경우 <br />4. "펜트하우스"를 이용하여 법령 또는 이 약관이
      금지하거나 공서양속에 반하는 행위를 하는 경우 <br />③ "펜트하우스"가
      회원자격을 제한·정지시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에
      그 사유가 시정되지 아니하는 경우 "펜트하우스"는 회원자격을 상실시킬 수
      있습니다. <br />④ "펜트하우스"가 회원자격을 상실시키는 경우에는 회원등록을
      말소합니다. 이 경우 "회원"에게 이를 통지하고, 회원등록 말소 전에 최소한
      30일 이상의 기간을 정하여 소명할 기회를 부여합니다. <br />제3장
      콘텐츠이용계약 <br />제13조("콘텐츠"의 내용 등의 게시) <br />①
      "펜트하우스"는 다음 사항을 해당 "콘텐츠"의 이용초기화면이나 그 포장에
      "이용자"가 알기 쉽게 표시합니다. <br />1. "콘텐츠"의 명칭 또는 제호
      <br />2. "콘텐츠"의 제작 및 표시 연월일 <br />3. "콘텐츠" 제작자의
      성명(법인인 경우에는 법인의 명칭), 주소, 전화번호 <br />4. "콘텐츠"의
      내용, 이용방법, 이용료 기타 이용조건 <br />② "펜트하우스"는 "콘텐츠"별
      이용가능기기 및 이용에 필요한 최소한의 기술사양에 관한 정보를
      계약체결과정에서 "이용자"에게 제공합니다. <br />제14조(이용계약의 성립 등)
      ① "이용자"는 "펜트하우스"가 제공하는 다음 또는 이와 유사한 절차에 의하여
      이용신청을 합니다. "펜트하우스"는 계약 체결 전에 각 호의 사항에 관하여
      "이용자"가 정확하게 이해하고 실수 또는 착오 없이 거래할 수 있도록 정보를
      제공합니다. <br />1. "콘텐츠" 목록의 열람 및 선택 <br />2. 성명, 주소,
      전화번호(또는 이동전화번호), 전자우편주소 등의 입력 <br />3. 약관내용,
      청약철회가 불가능한 "콘텐츠"에 대해 "펜트하우스"가 취한 조치에 관련한
      내용에 대한 확인 <br />4. 이 약관에 동의하고 위 제3호의 사항을 확인하거나
      거부하는 표시(예, 마우스 클릭) <br />5. "콘텐츠"의 이용신청에 관한 확인
      또는 "펜트하우스"의 확인에 대한 동의 <br />6. 결제방법의 선택 <br />②
      "펜트하우스"는 "이용자"의 이용신청이 다음 각 호에 해당하는 경우에는
      승낙하지 않거나 승낙을 유보할 수 있습니다. <br />1. 실명이 아니거나 타인의
      명의를 이용한 경우 <br />2. 허위의 정보를 기재하거나, "펜트하우스"가
      제시하는 내용을 기재하지 않은 경우 <br />3. 미성년자가 청소년보호법에
      의해서 이용이 금지되는 "콘텐츠"를 이용하고자 하는 경우 <br />4. 서비스
      관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우 <br />③
      "펜트하우스"의 승낙이 제16조 제1항의 수신확인통지형태로 "이용자"에게
      도달한 시점에 계약이 성립한 것으로 봅니다. <br />④ "펜트하우스"의 승낙의
      의사표시에는 "이용자"의 이용신청에 대한 확인 및 서비스제공 가능여부,
      이용신청의 정정·취소 등에 관한 정보 등을 포함합니다. <br />제15조(미성년자
      이용계약에 관한 특칙) "펜트하우스"는 만 20세 미만의 미성년이용자가
      유료서비스를 이용하고자 하는 경우에 부모 등 법정 대리인의 동의를 얻거나,
      계약체결 후 추인을 얻지 않으면 미성년자 본인 또는 법정대리인이 그 계약을
      취소할 수 있다는 내용을 계약체결 전에 고지하는 조치를 취합니다.
      <br />제16조(수신확인통지·이용신청 변경 및 취소) <br />① "펜트하우스"는
      "이용자"의 이용신청이 있는 경우 "이용자"에게 수신확인통지를 합니다.
      <br />② 수신확인통지를 받은 "이용자"는 의사표시의 불일치 등이 있는
      경우에는 수신확인통지를 받은 후 즉시 이용신청 변경 및 취소를 요청할 수
      있고, "펜트하우스"는 서비스제공 전에 "이용자"의 요청이 있는 경우에는 지체
      없이 그 요청에 따라 처리하여야 합니다. 다만, 이미 대금을 지불한 경우에는
      청약철회 등에 관한 제27조의 규정에 따릅니다. <br />제17조("펜트하우스"의
      의무) <br />① "펜트하우스"는 법령과 이 약관이 정하는 권리의 행사와 의무의
      이행을 신의에 좇아 성실하게 하여야 합니다. <br />② "펜트하우스"는
      "이용자"가 안전하게 "콘텐츠"를 이용할 수 있도록 개인정보(신용정보
      포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보보호정책을 공시하고
      준수합니다. <br />③ "펜트하우스"는 "이용자"가 콘텐츠이용 및 그 대금내역을
      수시로 확인할 수 있도록 조치합니다. <br />④ "펜트하우스"는 콘텐츠이용과
      관련하여 "이용자"로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는
      이를 지체없이 처리합니다. 이용자가 제기한 의견이나 불만사항에 대해서는
      게시판을 활용하거나 전자우편 등을 통하여 그 처리과정 및 결과를 전달합니다.
      <br />⑤ "펜트하우스"는 이 약관에서 정한 의무 위반으로 인하여 "이용자"가
      입은 손해를 배상합니다. <br />제18조("이용자"의 의무) <br />① "이용자"는
      다음 행위를 하여서는 안 됩니다. <br />1. 신청 또는 변경 시 허위내용의 기재
      <br />2. 타인의 정보도용 <br />3. "펜트하우스"에 게시된 정보의 변경
      <br />4. "펜트하우스"가 금지한 정보(컴퓨터 프로그램 등)의 송신 또는 게시
      <br />5. "펜트하우스"와 기타 제3자의 저작권 등 지적재산권에 대한 침해
      <br />6. "펜트하우스" 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는
      행위 <br />7. 외설 또는 폭력적인 말이나 글, 화상, 음향, 기타 공서양속에
      반하는 정보를 "펜트하우스"의 사이트에 공개 또는 게시하는 행위 <br />8.
      기타 불법적이거나 부당한 행위 <br />② "이용자"는 관계법령, 이 약관의 규정,
      이용안내 및 "콘텐츠"와 관련하여 공지한 주의사항, "펜트하우스"가 통지하는
      사항 등을 준수하여야 하며, 기타 "펜트하우스"의 업무에 방해되는 행위를
      하여서는 안 됩니다. <br />제19조(지급방법) "콘텐츠"의 이용에 대한
      대금지급방법은 다음 각 호의 방법 중 가능한 방법으로 할 수 있습니다. 다만,
      "펜트하우스"는 "이용자"의 지급방법에 대하여 어떠한 명목의 수수료도
      추가하여 징수하지 않습니다. <br />1. 폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의
      각종 계좌이체 <br />2. 선불카드, 직불카드, 신용카드 등의 각종 카드결제
      <br />3. 온라인무통장입금 <br />4. 전자화폐에 의한 결제 <br />5. 마일리지
      등 "펜트하우스"가 지급한 포인트에 의한 결제 <br />6. "펜트하우스"와 계약을
      맺었거나 "펜트하우스"가 인정한 상품권에 의한 결제 <br />7. 전화 또는
      휴대전화를 이용한 결제 <br />8. 기타 전자적 지급방법에 의한 대금지급 등
      제20조(콘텐츠서비스의 제공 및 중단) <br />① 콘텐츠서비스는 연중무휴, 1일
      24시간 제공함을 원칙으로 합니다. <br />② "펜트하우스"는 컴퓨터 등
      정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가
      있는 경우 콘텐츠서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우
      "펜트하우스"는 제11조["회원"에 대한 통지]에 정한 방법으로 "이용자"에게
      통지합니다. 다만, "펜트하우스"가 사전에 통지할 수 없는 부득이한 사유가
      있는 경우 사후에 통지할 수 있습니다. <br />③ "펜트하우스"는 상당한 이유
      없이 콘텐츠서비스의 제공이 일시적으로 중단됨으로 인하여 "이용자"가 입은
      손해에 대하여 배상합니다. 다만, "펜트하우스"가 고의 또는 과실이 없음을
      입증하는 경우에는 그러하지 아니합니다. <br />④ "펜트하우스"는
      콘텐츠서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며,
      정기점검시간은 서비스제공화면에 공지한 바에 따릅니다. <br />⑤ 사업종목의
      전환, 사업의 포기, 업체 간의 통합 등의 이유로 콘텐츠서비스를 제공할 수
      없게 되는 경우에는 "펜트하우스"는 제11조["회원"에 대한 통지]에 정한
      방법으로 "이용자"에게 통지하고 당초 "펜트하우스"에서 제시한 조건에 따라
      "이용자"에게 보상합니다. 다만, "펜트하우스"가 보상기준 등을 고지하지
      아니하거나, 고지한 보상기준이 적절하지 않은 경우에는 "이용자"들의 마일리지
      또는 적립금 등을 현물 또는 현금으로 "이용자"에게 지급합니다.
      <br />제21조(콘텐츠서비스의 변경) <br />① "펜트하우스"는 상당한 이유가
      있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 콘텐츠서비스를
      변경할 수 있습니다. <br />② "펜트하우스"는 콘텐츠서비스의 내용, 이용방법,
      이용시간을 변경할 경우에 변경사유, 변경될 콘텐츠서비스의 내용 및 제공일자
      등을 그 변경 전 7일 이상 해당 콘텐츠초기화면에 게시합니다. <br />③ 제2항의
      경우에 변경된 내용이 중대하거나 "이용자"에게 불리한 경우에는
      "펜트하우스"가 해당 콘텐츠서비스를 제공받는 "이용자"에게 제11조["회원"에
      대한 통지]에 정한 방법으로 통지하고 동의를 받습니다. 이때, "펜트하우스"는
      동의를 거절한 "이용자"에 대하여는 변경전 서비스를 제공합니다. 다만, 그러한
      서비스 제공이 불가능할 경우 계약을 해지할 수 있습니다. <br />④
      "펜트하우스"는 제1항에 의한 서비스의 변경 및 제3항에 의한 계약의 해지로
      인하여 "이용자"가 입은 손해를 배상합니다. 제22조(정보의 제공 및 광고의
      게재) <br />① "펜트하우스"는 "이용자"가 콘텐츠이용 중 필요하다고 인정되는
      다양한 정보를 공지사항이나 전자우편 등의 방법으로 "회원"에게 제공할 수
      있습니다. 다만, "회원"은 언제든지 전자우편 등을 통하여 수신 거절을 할 수
      있습니다. <br />② 제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고
      하는 경우에는 "회원"의 사전 동의를 받아서 전송합니다. <br />③
      "펜트하우스"는 "콘텐츠"서비스 제공과 관련하여 콘텐츠화면, 홈페이지,
      전자우편 등에 광고를 게재할 수 있습니다. 광고가 게재된 전자우편 등을
      수신한 "회원"은 수신거절을 "펜트하우스"에게 할 수 있습니다.
      <br />제23조(게시물의 삭제) <br />① "펜트하우스"는 게시판에
      정보통신망이용촉진 및 정보보호 등에 관한 법률을 위반한 청소년유해매체물이
      게시되어 있는 경우에는 이를 지체 없이 삭제 합니다. 다만, 19세 이상의
      "이용자"만 이용할 수 있는 게시판은 예외로 합니다. <br />② "펜트하우스"가
      운영하는 게시판 등에 게시된 정보로 인하여 법률상 이익이 침해된 자는
      "펜트하우스"에게 당해 정보의 삭제 또는 반박내용의 게재를 요청할 수
      있습니다. 이 경우 "펜트하우스"는 지체 없이 필요한 조치를 취하고 이를 즉시
      신청인에게 통지합니다. <br />제24조(저작권 등의 귀속) <br />①
      "펜트하우스"가 작성한 저작물에 대한 저작권 기타 지적재산권은
      "펜트하우스"에 귀속합니다. <br />② "펜트하우스"가 제공하는 서비스 중
      제휴계약에 의해 제공되는 저작물에 대한 저작권 기타 지적재산권은 해당
      제공업체에 귀속합니다. <br />③ "이용자"는 "펜트하우스"가 제공하는 서비스를
      이용함으로써 얻은 정보 중 "펜트하우스" 또는 제공업체에 지적재산권이 귀속된
      정보를 "펜트하우스" 또는 제공업체의 사전승낙 없이 복제, 전송, 출판, 배포,
      방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게
      하여서는 안 됩니다. <br />④ "펜트하우스"는 약정에 따라 "이용자"의 저작물을
      사용하는 경우 당해 "이용자"의 허락을 받습니다. <br />제25조(개인정보보호)
      <br />① "펜트하우스"는 제7조 제2항의 신청서기재사항 이외에 "이용자"의
      콘텐츠이용에 필요한 최소한의 정보를 수집할 수 있습니다. 이를 위해
      "펜트하우스"가 문의한 사항에 관해 "이용자"는 진실한 내용을 성실하게
      고지하여야 합니다. <br />② "펜트하우스"가 "이용자"의 개인 식별이 가능한
      "개인정보"를 수집하는 때에는 당해 "이용자"의 동의를 받습니다. <br />③
      "펜트하우스"는 "이용자"가 이용신청 등에서 제공한 정보와 제1항에 의하여
      수집한 정보를 당해 "이용자"의 동의 없이 목적 외로 이용하거나 제3자에게
      제공할 수 없으며, 이를 위반한 경우에 모든 책임은 "펜트하우스"가 집니다.
      다만, 다음의 경우에는 예외로 합니다. <br />1. 통계작성, 학술연구 또는
      시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로
      제공하는 경우 <br />2. "콘텐츠" 제공에 따른 요금정산을 위하여 필요한 경우
      <br />3. 도용방지를 위하여 본인확인에 필요한 경우 <br />4. 약관의 규정
      또는 법령에 의하여 필요한 불가피한 사유가 있는 경우 <br />④ "펜트하우스"가
      제2항과 제3항에 의해 "이용자"의 동의를 받아야 하는 경우에는
      "개인정보"관리책임자의 신원(소속, 성명 및 전화번호 기타 연락처), 정보의
      수집목적 및 이용목적, 제3자에 대한 정보제공관련사항(제공받는 자, 제공목적
      및 제공할 정보의 내용)등에 관하여 정보통신망이용촉진 및 정보보호 등에 관한
      법률 제22조 제2항이 규정한 사항을 명시하고 고지하여야 합니다. <br />⑤
      "이용자"는 언제든지 제3항의 동의를 임의로 철회할 수 있습니다. <br />⑥
      "이용자"는 언제든지 "펜트하우스"가 가지고 있는 자신의 "개인정보"에 대해
      열람 및 오류의 정정을 요구할 수 있으며, "펜트하우스"는 이에 대해 지체 없이
      필요한 조치를 취할 의무를 집니다. "이용자"가 오류의 정정을 요구한 경우에는
      "펜트하우스"는 그 오류를 정정할 때까지 당해 "개인정보"를 이용하지
      않습니다. <br />⑦ "펜트하우스"는 개인정보보호를 위하여 관리자를 한정하여
      그 수를 최소화하며, 신용카드, 은행계좌 등을 포함한 "이용자"의 "개인정보"의
      분실, 도난, 유출, 변조 등으로 인한 "이용자"의 손해에 대하여 책임을 집니다.
      <br />⑧ "펜트하우스" 또는 그로부터 "개인정보"를 제공받은 자는 "이용자"가
      동의한 범위 내에서 "개인정보"를 사용할 수 있으며, 목적이 달성된 경우에는
      당해 "개인정보"를 지체 없이 파기합니다. <br />⑨ "펜트하우스"는
      정보통신망이용촉진 및 정보보호에 관한 법률 등 관계 법령이 정하는 바에 따라
      "이용자"의 "개인정보"를 보호하기 위해 노력합니다. "개인정보"의 보호 및
      사용에 대해서는 관련법령 및 "펜트하우스"의 개인정보보호정책이 적용됩니다.
      <br />제4장 콘텐츠이용계약의 청약철회, 계약해제·해지 및 이용제한
      <br />제26조("이용자"의 청약철회와 계약해제·해지) <br />① "펜트하우스"와
      "콘텐츠"의 이용에 관한 계약을 체결한 "이용자"는 수신확인의 통지를 받은
      날로부터 7일 이내에는 청약의 철회를 할 수 있습니다. 다만, "펜트하우스"가
      다음 각 호중 하나의 조치를 취한 경우에는 "이용자"의 청약철회권이 제한될 수
      있습니다. <br />1. 청약의 철회가 불가능한 "콘텐츠"에 대한 사실을
      표시사항에 포함한 경우 <br />2. 시용상품을 제공한 경우 <br />3. 한시적
      또는 일부이용 등의 방법을 제공한 경우 <br />② "이용자"는 다음 각 호의
      사유가 있을 때에는 당해 "콘텐츠"를 공급받은 날로부터 3월 이내 또는 그
      사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 콘텐츠이용계약을
      해제·해지할 수 있습니다. <br />1. 이용계약에서 약정한 "콘텐츠"가 제공되지
      않는 경우 <br />2. 제공되는 "콘텐츠"가 표시·광고 등과 상이하거나 현저한
      차이가 있는 경우 <br />3. 기타 "콘텐츠"의 결함으로 정상적인 이용이 현저히
      불가능한 경우 <br />③ 제1항의 청약철회와 제2항의 계약해제·해지는
      "이용자"가 전화, 전자우편 또는 모사전송으로 "펜트하우스"에 그 의사를
      표시한 때에 효력이 발생합니다. <br />④ "펜트하우스"는 제3항에 따라
      "이용자"가 표시한 청약철회 또는 계약해제·해지의 의사표시를 수신한 후 지체
      없이 이러한 사실을 "이용자"에게 회신합니다. <br />⑤ "이용자"는 제2항의
      사유로 계약해제·해지의 의사표시를 하기 전에 상당한 기간을 정하여 완전한
      "콘텐츠" 혹은 서비스이용의 하자에 대한 치유를 요구할 수 있습니다.
      <br />제27조("이용자"의 청약철회와 계약해제·해지의 효과) <br />①
      "펜트하우스"는 "이용자"가 청약철회의 의사표시를 한 날로부터 또는
      "이용자"에게 계약해제·해지의 의사표시에 대하여 회신한 날로부터 3영업일
      이내에 대금의 결제와 동일한 방법으로 이를 환급하여야 하며, 동일한 방법으로
      환불이 불가능할 때에는 이를 사전에 고지하여야 합니다. 이 경우
      "펜트하우스"가 "이용자"에게 환급을 지연한 때에는 그 지연기간에 대하여
      공정거래위원회가 정하여 고시하는 지연이자율을 곱하여 산정한 지연이자를
      지급합니다. <br />② "펜트하우스"가 제1항에 따라 환급할 경우에 "이용자"가
      서비스이용으로부터 얻은 이익에 해당하는 금액을 공제하고 환급할 수
      있습니다. <br />③ "펜트하우스"는 위 대금을 환급함에 있어서 "이용자"가
      신용카드 또는 전자화폐 등의 결제수단으로 재화 등의 대금을 지급한 때에는
      지체 없이 당해 결제수단을 제공한 사업자로 하여금 재화 등의 대금의 청구를
      정지 또는 취소하도록 요청합니다. 다만, 제2항의 금액공제가 필요한 경우에는
      그러하지 아니할 수 있습니다. <br />④ "펜트하우스", "콘텐츠 등의 대금을
      지급 받은 자" 또는 "이용자와 콘텐츠이용계약을 체결한 자"가 동일인이 아닌
      경우에 각자는 청약철회 또는 계약해제·해지로 인한 대금환급과 관련한 의무의
      이행에 있어서 연대하여 책임을 집니다. <br />⑤ "펜트하우스"는 "이용자"에게
      청약철회를 이유로 위약금 또는 손해배상을 청구하지 않습니다. 그러나
      "이용자"의 계약해제·해지는 손해배상의 청구에 영향을 미치지 않습니다.
      <br />제28조(펜트하우스의 계약해제·해지 및 이용제한) <br />①
      "펜트하우스"는 "이용자"가 제12조 제2항에서 정한 행위를 하였을 경우
      사전통지 없이 계약을 해제·해지하거나 또는 기간을 정하여 서비스이용을
      제한할 수 있습니다. <br />② 제1항의 해제·해지는 "펜트하우스"가 자신이 정한
      통지방법에 따라 "이용자"에게 그 의사를 표시한 때에 효력이 발생합니다.
      <br />③ "펜트하우스"의 해제·해지 및 이용제한에 대하여 "이용자"는
      "펜트하우스"가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가
      정당하다고 "펜트하우스"가 인정하는 경우, "펜트하우스"는 즉시 서비스의
      이용을 재개합니다. <br />제29조(펜트하우스의 계약해제·해지의 효과)
      "이용자"의 귀책사유에 따른 이용계약의 해제·해지의 효과는 제27조를
      준용합니다. 다만, "펜트하우스"는 "이용자"에 대하여 계약해제·해지의
      의사표시를 한 날로부터 7영업일 이내에 대금의 결제와 동일한 방법으로 이를
      환급합니다. <br />제5장 과오금, 피해보상 등 <br />제30조(과오금) <br />①
      "펜트하우스"는 과오금이 발생한 경우 이용대금의 결제와 동일한 방법으로
      과오금 전액을 환불하여야 합니다. 다만, 동일한 방법으로 환불이 불가능할
      때는 이를 사전에 고지합니다. <br />② "펜트하우스"의 책임 있는 사유로
      과오금이 발생한 경우 "펜트하우스"는 계약비용, 수수료 등에 관계없이 과오금
      전액을 환불합니다. 다만, "이용자"의 책임 있는 사유로 과오금이 발생한 경우,
      "펜트하우스"가 과오금을 환불하는 데 소요되는 비용은 합리적인 범위 내에서
      "이용자"가 부담하여야 합니다. <br />③ 펜트하우스는 "이용자"가 주장하는
      과오금에 대해 환불을 거부할 경우에 정당하게 이용대금이 부과되었음을 입증할
      책임을 집니다. <br />④ "펜트하우스"는 과오금의 환불절차를
      디지털콘텐츠이용자보호지침에 따라 처리합니다. <br />제31조(콘텐츠하자 등에
      의한 이용자피해보상) "펜트하우스"는 콘텐츠하자 등에 의한 이용자피해보상의
      기준·범위·방법 및 절차에 관한 사항을 디지털콘텐츠이용자보호지침에 따라
      처리합니다. <br />제32조(면책조항) <br />① "펜트하우스"는 천재지변 또는
      이에 준하는 불가항력으로 인하여 "콘텐츠"를 제공할 수 없는 경우에는
      "콘텐츠" 제공에 관한 책임이 면제됩니다. <br />② "펜트하우스"는 "이용자"의
      귀책사유로 인한 콘텐츠이용의 장애에 대하여는 책임을 지지 않습니다. <br />③
      "펜트하우스"는 "회원"이 "콘텐츠"와 관련하여 게재한 정보, 자료, 사실의
      신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다. <br />④
      "펜트하우스"는 "이용자" 상호간 또는 "이용자"와 제3자 간에 "콘텐츠"를
      매개로 하여 발생한 분쟁 등에 대하여 책임을 지지 않습니다.
      <br />제33조(분쟁의 해결) "펜트하우스"는 분쟁이 발생하였을 경우에
      "이용자"가 제기하는 정당한 의견이나 불만을 반영하여 적절하고 신속한 조치를
      취합니다. 다만, 신속한 처리가 곤란한 경우에 "펜트하우스"는 "이용자"에게 그
      사유와 처리일정을 통보합니다.
                </p>
                </div>
                </form>
              </dialog>

              <button class="btn btn-outline px-1">
                <a href="https://www.danalpay.com/escrow/confirmation.aspx?param=CtA4eCJjz8ctQOdu7tgO%2Fw%3D%3D" class="flex flex-row items-center">
                  <img :src="require('~/assets/img/fishingyou_main/escrow_logo.png')" class="w-5 h-5">
                  <div class="ml-1">에스크로확인인증</div>
                </a>
              </button>
            </div>
            </div>
          </div>
        </div>
        <!--<div
          class="md:w-full lg:w-full lg:border-r w-full sm:w-1/2 xl:w-fit sm:px-16 py-6 sm:py-12 border-t sm:border-t xl:border-r border-[#DDDDDD]"
        >
          <ul class="space-y-4">
            <NavLink name="Products" url="#" />
            <NavLink name="About Us" url="#" />
            <NavLink name="Careers" url="#" />
            <NavLink name="Blog" url="#" />
            <NavLink name="Security" url="#" />
          </ul>
        </div>
         <div
          class="md:w-full md:border-t lg:w-full w-full sm:w-1/2 xl:w-fit sm:px-16 py-6 sm:py-12 border-t sm:border-t-0 sm:border-r-0 border-[#DDDDDD]"
        >
          <ul class="space-y-4">
            <NavLink name="Help Center" url="#" />
            <NavLink name="Contact Us" url="#" />
            <NavLink name="System Status" url="#" />
            <NavLink name="Area of Avaibility" url="#" />
            <NavLink name="Privacy Policy" url="#" />
          </ul>
        </div>
        <div
          class="md:w-full md:border-t lg:w-full sm:px-10 py-6 sm:py-12 w-full sm:w-1/2 xl:w-[22rem] space-y-4 sm:border-t border-[#DDDDDD]"
        >
          <h5 class="text-sm font-medium text-[#666666] focus:outline-none focus:shadow-outline">Newsletter</h5>
          <p class="text-sm text-[#666666] focus:outline-none focus:shadow-outline">
            Never miss anything crypto when <br class="sm:hidden" />you're on the go
          </p>
          <div class="flex items-center space-x-2">
            <input
              type="text"
              class="w-full px-2 py-4 sm:py-3 rounded-lg sm:rounded-md text-sm focus:outline-none border border-[#AAAAAA] placeholder-[#888]"
              placeholder="Enter your email"
            />
            <button
              class="bg-blue-gradient px-4 py-4 sm:py-3 rounded-md text-white hover:shadow-md transition duration-300"
            >
              <ArrowRightIcon :size="20" />
            </button>
          </div>
        </div> -->
      </div>
    <div class="py-8 sm:py-4 text-center text-sm text-[#666666] hover:text-gray-900">
       Copyright 2023 &copy; PENTHOUSE Inc. All Rights Reserved.
    </div>
  </footer>
</template>
<script>
export default {
  name: 'BaseFooter',

}
</script>

<style scoped>
.card-title {
  font-size: 24px;
  font-weight: 500;
}
.btn-outline {
  display: inline-block;
  cursor: pointer;
  border-color: gray;
  border-width: 1px;
  border-radius: 0.5rem;
  --un-bg-opacity: 1;
  background-color: rgba(255, 255, 255, var(--un-bg-opacity));
  --un-text-opacity: 1;
  --un-shadow: 0 0 #0000;
  --un-shadow-colored: 0 0 #0000;
  box-shadow: var(--un-ring-offset-shadow, 0 0 #0000),
    var(--un-ring-shadow, 0 0 #0000), var(--un-shadow);
}
</style>
